# pandas

notes:
  1.panda is python library used for working with data set.
  2.it has functions for analysing ,cleaning,exploring and manipulating data.
  3.pandas allow us to analyse big data and make conclusion based on statistical theory.
  4.panads can claen messy dataset and make data relevant.
  5.relevant dta is very imp in field of data csience ,ml,and ai.
  6.data is never in the form of structured form i.e. row and col.

In [1]:
#pip install pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
#2 data structure in pandass
#1.Series=1 dimensional
#2.DataFrame=2 dimensional

In [4]:
list1=[2,3,4,5]
list2=["a","b","c","d"]
dict={"v":2,"c":3,"n":4,"j":5}
var=pd.Series(list1)
var

0    2
1    3
2    4
3    5
dtype: int64

In [5]:
var2=pd.Series(dict)
var2

v    2
c    3
n    4
j    5
dtype: int64

In [6]:
var3=pd.Series(data= list1,index = list2)
var3

a    2
b    3
c    4
d    5
dtype: int64

In [7]:
list1.pop(2)

4

In [8]:
var3["c"]

4

# concatenation

In [9]:
#pd.concat

In [10]:
x=pd.Series([2,3,4,5,7])
y=pd.Series(["a","b","c","d","e"])
pd.concat((x,y),ignore_index=True)

0    2
1    3
2    4
3    5
4    7
5    a
6    b
7    c
8    d
9    e
dtype: object

In [11]:
#dataframe

In [12]:
dt=np.random.randint(1,80,(6,6))
dt

array([[52,  9, 48, 32, 77, 74],
       [32, 66, 18, 21, 29, 43],
       [ 4, 43, 41, 49, 48, 48],
       [70, 78, 64, 39, 24,  5],
       [28, 40, 23, 70, 54, 26],
       [11, 78, 69, 20, 55, 68]])

In [13]:
pd.DataFrame(dt)

    0   1   2   3   4   5
0  52   9  48  32  77  74
1  32  66  18  21  29  43
2   4  43  41  49  48  48
3  70  78  64  39  24   5
4  28  40  23  70  54  26
5  11  78  69  20  55  68

In [14]:
#change index no of columns

In [15]:
#pandas dataframe notes in chrome on off website

In [16]:
pd.DataFrame(data=dt,columns=["x","y","c","b","e","n"])

    x   y   c   b   e   n
0  52   9  48  32  77  74
1  32  66  18  21  29  43
2   4  43  41  49  48  48
3  70  78  64  39  24   5
4  28  40  23  70  54  26
5  11  78  69  20  55  68

In [17]:
pd.DataFrame(data=dt,index=["u","g","l","p","i","r"])

    0   1   2   3   4   5
u  52   9  48  32  77  74
g  32  66  18  21  29  43
l   4  43  41  49  48  48
p  70  78  64  39  24   5
i  28  40  23  70  54  26
r  11  78  69  20  55  68

In [18]:
#thses are temporary changes

In [19]:
df=pd.DataFrame(data=dt,columns=["x","y","c","b","e","n"],index=["u","g","l","p","i","r"])
df

    x   y   c   b   e   n
u  52   9  48  32  77  74
g  32  66  18  21  29  43
l   4  43  41  49  48  48
p  70  78  64  39  24   5
i  28  40  23  70  54  26
r  11  78  69  20  55  68

In [20]:
df[["x"]]

    x
u  52
g  32
l   4
p  70
i  28
r  11

In [21]:
df[["x","y","c"]]

    x   y   c
u  52   9  48
g  32  66  18
l   4  43  41
p  70  78  64
i  28  40  23
r  11  78  69

In [22]:
#how to access row ,we have to use function:

In [23]:
#ilock stands for integer location you can access the row by using the index number

In [24]:
df.loc[["u"]]

    x  y   c   b   e   n
u  52  9  48  32  77  74

In [25]:
df.iloc[2]

x     4
y    43
c    41
b    49
e    48
n    48
Name: l, dtype: int32

In [26]:
#add new columns

In [27]:
df["n_c"]=[3,5,6,7,23,45]
df

    x   y   c   b   e   n  n_c
u  52   9  48  32  77  74    3
g  32  66  18  21  29  43    5
l   4  43  41  49  48  48    6
p  70  78  64  39  24   5    7
i  28  40  23  70  54  26   23
r  11  78  69  20  55  68   45

In [28]:
df

    x   y   c   b   e   n  n_c
u  52   9  48  32  77  74    3
g  32  66  18  21  29  43    5
l   4  43  41  49  48  48    6
p  70  78  64  39  24   5    7
i  28  40  23  70  54  26   23
r  11  78  69  20  55  68   45

In [29]:
#delete column

In [30]:
#drop fun is used for deleting a column

In [31]:
df.drop("c",axis=1)

    x   y   b   e   n  n_c
u  52   9  32  77  74    3
g  32  66  21  29  43    5
l   4  43  49  48  48    6
p  70  78  39  24   5    7
i  28  40  70  54  26   23
r  11  78  20  55  68   45

In [32]:
#axis=0 means row and axis=1 means column

In [33]:
#this is a temporary chnge

In [34]:
#to do permanent we have to use inplace fun

In [35]:
df.drop("c",axis=1,inplace=True)
df

    x   y   b   e   n  n_c
u  52   9  32  77  74    3
g  32  66  21  29  43    5
l   4  43  49  48  48    6
p  70  78  39  24   5    7
i  28  40  70  54  26   23
r  11  78  20  55  68   45

In [36]:
df

    x   y   b   e   n  n_c
u  52   9  32  77  74    3
g  32  66  21  29  43    5
l   4  43  49  48  48    6
p  70  78  39  24   5    7
i  28  40  70  54  26   23
r  11  78  20  55  68   45

In [37]:
df.drop("g",axis=0,inplace=True)
df

    x   y   b   e   n  n_c
u  52   9  32  77  74    3
l   4  43  49  48  48    6
p  70  78  39  24   5    7
i  28  40  70  54  26   23
r  11  78  20  55  68   45

In [38]:
df.drop("n_c",axis=1)

    x   y   b   e   n
u  52   9  32  77  74
l   4  43  49  48  48
p  70  78  39  24   5
i  28  40  70  54  26
r  11  78  20  55  68

In [39]:
df["x"]% 2==0

u     True
l     True
p     True
i     True
r    False
Name: x, dtype: bool

In [40]:
df[df["y"]% 2==0]["y"]

p    78
i    40
r    78
Name: y, dtype: int32

In [41]:
df["x"]%2>50

u    False
l    False
p    False
i    False
r    False
Name: x, dtype: bool

In [42]:
df[df["x"]%2==0 & (df["x"]>50)]["x"]

u    52
l     4
p    70
i    28
Name: x, dtype: int32

In [43]:
#to read dataframe we use csv file

In [44]:
df=pd.read_csv()

TypeError: read_csv() missing 1 required positional argument: 'filepath_or_buffer'